results/pro6000_l40s_h100_h200_11_2025/GLM-4.6-FP16/h200_x_8_zai-org_GLM-4.6_vllm_benchmark.txt
============ Serving Benchmark Result ============
Successful requests:                     2048      
Maximum request concurrency:             512       
Benchmark duration (s):                  430.33    
Total input tokens:                      2045447   
Total generated tokens:                  2048000   
Request throughput (req/s):              4.76      
Output token throughput (tok/s):         4759.15   
Peak output token throughput (tok/s):    7168.00   
Peak concurrent requests:                537.00    
Total Token throughput (tok/s):          9512.36   
---------------Time to First Token----------------
Mean TTFT (ms):                          7415.30   
Median TTFT (ms):                        4155.46   
P99 TTFT (ms):                           30024.23  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          96.39     
Median TPOT (ms):                        98.47     
P99 TPOT (ms):                           110.71    
---------------Inter-token Latency----------------
Mean ITL (ms):                           96.56     
Median ITL (ms):                         76.43     
P99 ITL (ms):                            418.08    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          103711.53 
Median E2EL (ms):                        102737.99 
P99 E2EL (ms):                           136011.79 
==================================================

============ Docker Compose Configuration ============
services:
  vllm_0:
    image: vllm/vllm-openai:latest
    container_name: vllm_benchmark_container_0
    deploy:
      resources:
        reservations:
          devices:
            - driver: nvidia
              device_ids: ['0', '1', '2', '3', '4', '5', '6', '7']
              capabilities: [gpu]
    volumes:
      - /media/cloudrift/hf_models:/media/cloudrift/hf_models
    environment:
      - HUGGING_FACE_HUB_TOKEN=
      - HF_HOME=/media/cloudrift/hf_models
    ports:
      - "8000:8000"
    shm_size: '16gb'
    ipc: host
    command: >
      --trust-remote-code
      --gpu-memory-utilization=0.9
      --host 0.0.0.0
      --port 8000
      --tensor-parallel-size 8
      --pipeline-parallel-size 1
      --model /media/cloudrift/hf_models/zai-org/GLM-4.6
      --served-model-name zai-org/GLM-4.6
      --tool-call-parser glm45 --reasoning-parser glm45 --max-num-seqs 512 --max-model-len 8192
    healthcheck:
      test: ["CMD", "bash", "-c", "curl -f http://localhost:8000/health && curl -f http://localhost:8000/v1/models | grep -q 'object.*list'"]
      interval: 10s
      timeout: 10s
      retries: 180
      start_period: 600s

  benchmark:
    image: vllm/vllm-openai:latest
    container_name: vllm_benchmark_client
    deploy:
      resources:
        reservations:
          devices:
            - driver: nvidia
              count: all
              capabilities: [gpu]
    volumes:
      - /media/cloudrift/hf_models:/media/cloudrift/hf_models
    environment:
      - HUGGING_FACE_HUB_TOKEN=
      - HF_HOME=/media/cloudrift/hf_models
      - CUDA_VISIBLE_DEVICES=""
    entrypoint: ["/bin/bash", "-c"]
    command: ["sleep infinity"]
    profiles:
      - tools

============ Benchmark Command ============
vllm bench serve     --model zai-org/GLM-4.6     --dataset-name random     --random-input-len 1000     --random-output-len 1000     --max-concurrency 512     --num-prompts 2048     --ignore-eos     --backend openai-chat     --endpoint /v1/chat/completions     --percentile-metrics ttft,tpot,itl,e2el     --base-url http://vllm_0:8000
==================================================